backend/app/controllers/api/v1/auctions_controller.rb

  def index
    @auctions = Auction.all
---
SELECT "auctions".* FROM "auctions"

  def create
    @auction = Auction.create(auction_params)
    @auctions = Auction.all
---
INSERT INTO "auctions" ("item_name", "item_description", "item_pic", "seller_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["item_name", "heyo"], ["item_description", ""], ["item_pic", ""], ["seller_id", 1], ["created_at", "2018-10-19 18:28:11.933765"], ["updated_at", "2018-10-19 18:28:11.933765"]]
SELECT "auctions".* FROM "auctions"

  def destroy
    @auction = Auction.find(params[:id])
    @auction.destroy
    @auctions = Auction.all
---
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "auctions" WHERE "auctions"."id" = $1  [["id", 1]]
SELECT "auctions".* FROM "auctions"