backend/app/controllers/api/v1/bids_controller.rb

  def index
    @bids = Bid.all
---
SELECT "bids".* FROM "bids"

  def create
    @bid = Bid.create(bid_params)
    @bids = Bid.all
---
INSERT INTO "bids" ("amount", "bidder_id", "auction_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 90.0], ["bidder_id", 1], ["auction_id", 3], ["created_at", "2018-10-22 15:05:06.567930"], ["updated_at", "2018-10-22 15:05:06.567930"]]
SELECT "bids".* FROM "bids"